backend/controllers/UserController.php

    public function actionIndex()
    {
        $model = new User('search');
        $model->load(Yii::$app->request->post());

        $data = User::find()->where(['status' => User::STATUS_ACTIVE]);
        $data->andFilterWhere(['like', 'username', $model->username]);
        $data->andFilterWhere(['like', 'mobile', $model->mobile]);

        $pager = new Pagination(['totalCount' => $data->count()]);
        $items = $data->offset($pager->offset)->limit($pager->limit)->orderBy('id desc')->all();
---
SELECT COUNT(*) FROM `user` WHERE `status`=10
SELECT * FROM `user` WHERE `status`=10 ORDER BY `id` DESC LIMIT 10